---
kind: type
id: T:Autodesk.Revit.DB.ProjectPosition
source: html/249111cc-c1f3-d3e1-e7bf-dc791327fd4c.htm
---
# Autodesk.Revit.DB.ProjectPosition

ProjectPosition is a class used to represent a geographical offset and rotation. It can be used to represent the
 position of a project.

## Syntax (C#)
```csharp
public class ProjectPosition : IDisposable
```